import { StyledAboutPageContainer } from "./style"

export function AboutPage(): JSX.Element {
    return (
        <StyledAboutPageContainer>
            <h3>
                УСЛОВИЯ ДОСТАВКИ И ВОЗВРАТА
            </h3>
            <p>
                Обращаем внимание, что в настоящее время в связи с геополитической ситуацией в стране, сроки доставки могут быть увеличены. Мы приложим все усилия для их соблюдения, тем не менее задержки в доставке возможны ввиду форс-мажорных обстоятельств.
            </p>
            <p>
                Сроки доставки зависят от населенного пункта, в который производится доставка.
            </p>
            <p>
                Срок доставки может быть увеличен ввиду высокой загруженности в период SALE, стартов продаж и сезонности.
            </p>
            <p>
                Заказ может быть отправлен несколькими посылками из разных городов.
            </p>
            <h3>
                ДОСТАВКА ПО РФ
            </h3>
            <p>
                Стоимость доставки рассчитывается автоматически. Бесплатная доставка осуществляется при заказе от 5 000 руб. Заказ может быть отправлен несколькими посылками из разных городов.
            </p>
            <p>
                На страницы представлены средние сроки доставки. Более точную дату вы сможете увидеть в письме-подтверждении, после передачи заказа в транспортную компанию.
            </p>
            <p>
                Срок сборки заказа составляет от 1–3 календарных дней.
            </p>
            <p>
                Срок доставки рассчитывается во время оформления заказа, он варьируется в зависимости от месторасположения склада и адресата.
            </p>
            <p>
                Москва и Санкт-Петербург и УРФО: 4–7 рабочих дней, не считая дня отправления, выходных и праздничных дней.
            </p>
            <p>
                ХМАО, ЯНАО и центральная часть России: 7–9 рабочих дней, не считая дня отправления, выходных и праздничных дней.
            </p>
            <p>
                Сибирь и Дальний Восток: 9–11 рабочих дней, не считая дня отправления, выходных и праздничных дней.
            </p>
            <p>
                Также стоит учитывать, что в период старта SALE, праздничных дней и выходных время сборки и доставки может быть увеличено.
            </p>
            <p>
                Обращаем Ваше внимание на то, что в оплаченный заказ мы не сможем внести корректировки, касающиеся смены цвета, размера, количества позиций и других характеристик. Если Ваш заказ еще не передан в транспортную компанию, то его возможно отменить. Для этого необходимо обратиться в онлайн-чат или позвонить по телефону: +7 (800) 35−55−23, 5.
            </p>

            <h3>
                ДОСТАВКА ПО СНГ
            </h3>
            <p>
                <strong>
                    В связи с геополитической ситуацией, осуществление возврата временно невозможно, просим учесть это при оформлении заказов.
                </strong>
            </p>
            <p>
                Бесплатная доставка осуществляется при заказе от 10 000 руб. Заказ может быть отправлен несколькими посылками из разных городов.
            </p>
            <p>
                Просим принять во внимание, что в зависимости от страны и суммы заказа может возникнуть необходимость оплаты таможенных сборов согласно таможенному законодательству страны назначения. Вы можете посмотреть подробную информацию об этом в таблице.
            </p>
            <h3>
                БЕСПЛАТНЫЙ ВОЗВРАТ С ПОМОЩЬЮ ПОСТАМАТОВ PICKPOINT
            </h3>
            <p>
                Если приобретенный товар не подошел вам по качеству или размерным характеристикам, вы можете быстро и удобно вернуть его через любой из постаматов PickPoint в течение 14 дней с момента получения заказа. Что для этого нужно сделать?
            </p>
            <ul>
                <li>
                    1. Выберите ближайшую к вам точку с приемом возврата товара (карта точек) ;
                </li>
                <li>
                    2. Заполните бланк возврата бланк возврата, упакуйте герметично возврат и укажите на упаковке свой номер мобильного телефона для связи;
                </li>
                <li>
                    3. На экране постамата выберите «Отправка заказов», далее нажмите кнопку «Возврат продавцу». На вопрос «Есть ли у Вас код?» выберите «Да». Введите код 471082061. Наклейте на упаковку возвратный стикер, который распечатает постамат. После того, как вы положите отправление в открывшуюся ячейку постамата, будет распечатана квитанция о приеме возврата;
                </li>
                <li>
                    4. Как только возвращаемый товар будет доставлен в интернет-магазин, вам придёт уведомление на мобильный телефон;
                </li>
                <li>
                    5. Отслеживать статус возврата можно на сайте или в мобильном приложении PickPoint .
                </li>
            </ul>
            <h3>
                ДРУГИЕ СПОСОБЫ ОСУЩЕСТВЛЕНИЯ ВОЗВРАТА
            </h3>
            <p>
                Если у вас нет возможности или желания использовать для возврата систему постаматов PickPoint, то вы можете воспользоваться любой другой удобной для вас курьерской службой. В таком случае отправка возврата осуществляется за счет покупателя, срок возврата также составит 14 дней. Возврат с помощью Почты России невозможен.
            </p>
            <p>
                Если вы являетесь участником программы лояльности в статусе FAMILY, то вы можете осуществлять бесплатные возвраты. Для того, чтобы оформить такой возврат, напишите в мобильном приложении онлайн-чат, и мы расскажем обо всех нюансах.
            </p>
            <p>
                После получения посылки возврат обрабатывается в течение 10 рабочих дней. После обработки возврата денежные средства возвращаются на карту, с которой был оплачен заказ.
            </p>
            <p>
                <strong>
                    Важный момент!
                </strong>
                В случае возврата заказа, частично оплаченного бонусными баллами, возвращается только сумма, оплаченная денежными средствами. Бонусные баллы вернутся при возврате в случае активности их срока действия на момент приема возврата.
            </p>
        </StyledAboutPageContainer>
    )
}